_protected/frontend/controllers/FuncionarioController.php

SELECT * FROM `funcionario` WHERE (`MATRICULA`='25469') AND (`SITUACAO` IN (1, 3, 4, 5))
SELECT * FROM `pessoa` WHERE `id`=26182
---
    public function actionCarregaFuncionario()
    {

        // quebrando a string para pegar o id_substituicao
        $data = Yii::$app->request->post();
        $func_array = explode("-", $data['funcionario']);
        $model = Funcionario::find()
                ->where(['MATRICULA' => $func_array[0]])
                ->andWhere(['in', 'SITUACAO', [1,3,4,5]])
                ->one();
        $pessoa = Pessoa::findOne($model->pessoa_id);