_protected/frontend/views/funcionario/_form.php

        <legend style="padding: 30px 5px 8px;"><span class="glyphicon glyphicon-chevron-right"
                style="margin: 0 8px 0 0;"></span>Lotação / local de tabalho:</legend>

        <?php   $divisoes = ArrayHelper::map($model->divisao->divisoesEmpresa, 'CODIGO', 'NOME') ?>
---
SELECT * FROM `divisao` WHERE (`EMPRESA_COD`, `CODIGO`) IN ((5, 1))