_protected/frontend/models/Divisao.php

SELECT * FROM `divisao` `d` WHERE `EMPRESA_COD`=5 ORDER BY `NOME`
---
    public function getDivisoesEmpresa()
    {
        $res = (new \yii\db\Query())
                ->select('*')
                ->from('divisao d')
                ->where(['EMPRESA_COD' => $this->EMPRESA_COD])
                ->orderBy('NOME')
                ->all();