_protected/frontend/models/Funcionario.php

SELECT * FROM `funcionario` `f` WHERE (`pessoa_id`=26182) AND (`SITUACAO` IN (1, 3, 4, 5)) ORDER BY `MATRICULA`
---
    public function getLotacao()
    {
        $res = (new \yii\db\Query())
                ->select('*')
                ->from('funcionario f')
                ->where(['pessoa_id' => $this->pessoa_id])
                ->andWhere(['in', 'SITUACAO', [1,3,4,5]])
                ->orderBy('MATRICULA')
                ->all();

SELECT * FROM `atividade` `a` WHERE `EMPRESA_COD`=5 ORDER BY `NOME`
---
    public function getAtividades()
    {
        $res = (new \yii\db\Query())
                ->select('*')
                ->from('atividade a')
                ->where(['EMPRESA_COD' => $this->EMPRESA_COD])
                ->orderBy('NOME')
                ->all();